# Introduction to Pandas

Here we will learn how to use pandas for data analysis. You can think of pandas as an extremely powerful version of Excel, with a lot more features. In this section of the course, you should go through the notebooks in this order:

* Introduction to Pandas
* Series
* DataFrames
* Missing Data
* GroupBy
* Merging,Joining and Concatenating
* Operations

In [1]:
import numpy as np
import pandas as pd

### Creating a Series

You can convert a list,numpy array, or dictionary to a Series:

In [37]:
labels = ['a','b','c','d']
my_list = [10,20,30,40]
arr = np.array([10,20,30,40,50,60])
d = {'a':10,'B':200,'c':30}

In [42]:
#pd.Series(data=my_list)
#pd.Series(data=my_list,index=labels)
#pd.Series(labels,data) ###always put data first and then labels. otherwise name them beforehand as shown below.
pd.Series(index=labels,data=my_list)

a    10
b    20
c    30
d    40
dtype: int64

In [46]:
#pd.Series(arr)
pd.Series(arr,labels)   ###as length of arr is 6 and length of labels is 4, it doesn't match and thus gives error.
#index=['a','B','c','D','e','F']

ValueError: Length of passed values is 6, index implies 4.

In [47]:
d

{'a': 10, 'B': 200, 'c': 30}

In [48]:
pd.Series(d)

a     10
B    200
c     30
dtype: int64

In [53]:
#pd.Series(index=['Sam','Ram','Sachin','Arun','Kabeer'],data=[32,28,26,34,20])
#pd.Series(['Sam','Ram','Sachin','Arun','Kabeer'],[32,28,26,34,20])
pd.Series([32,28,26,34,20],['Sam','Ram','Sachin','Arun','Kabeer'])

Sam       32
Ram       28
Sachin    26
Arun      34
Kabeer    20
dtype: int64

# DataFrames

DataFrames are the workhorse of pandas and are directly inspired by the R programming language.
We can think of a DataFrame as a bunch of Series objects put together to share the same index.

In [19]:
#import pandas as pd
#import numpy as np

In [58]:
from numpy.random import randn
np.random.seed(69)#999999999)

In [59]:
randn(10,2)
#'A_B_C_D'.split('_')

array([[ 0.9155071 , -0.60354197],
       [ 1.16229517, -0.60140014],
       [-1.59748566,  0.39772612],
       [ 1.20586542,  1.05629911],
       [ 0.85254391,  0.68939141],
       [-0.22473706, -0.52218217],
       [-0.84007163,  1.18058312],
       [-1.32884084, -0.12439675],
       [-0.4974814 , -1.94712335],
       [-1.84865498,  0.26466031]])

In [60]:
'A_B_C_D_E'.split('_')

['A', 'B', 'C', 'D', 'E']

In [61]:
df = pd.DataFrame(randn(5,4),
                  index='A_B_C_D_E'.split('_'),
                  columns='W X Y Z'.split())
df

          W         X         Y         Z
A  0.934572 -1.169964  0.739605 -1.112155
B -1.981927 -1.193872  0.168626 -2.098613
C  0.019155  0.302186 -0.960382  1.591763
D  0.352333 -0.651946 -1.162002 -2.283038
E -0.662735 -0.274120  1.375766 -0.190233

## Selection and Indexing

Let's learn the various methods to grab data from a DataFrame

In [66]:
#df['W'] # or try 
#df.Z #, Single column becomes series #doesn't work if column name has 2 words(eg. serial number) in such case use above code.
#type(df['Z'])
df.W

A    0.934572
B   -1.981927
C    0.019155
D    0.352333
E   -0.662735
Name: W, dtype: float64

In [68]:
type(df.W)

pandas.core.series.Series

In [69]:
New_var=df.W.copy()
New_var

A    0.934572
B   -1.981927
C    0.019155
D    0.352333
E   -0.662735
Name: W, dtype: float64

In [70]:
New_var[0] = 15

In [71]:
df

          W         X         Y         Z
A  0.934572 -1.169964  0.739605 -1.112155
B -1.981927 -1.193872  0.168626 -2.098613
C  0.019155  0.302186 -0.960382  1.591763
D  0.352333 -0.651946 -1.162002 -2.283038
E -0.662735 -0.274120  1.375766 -0.190233

In [72]:
# Pass a list of column names
df[['W','Y']]

          W         Y
A  0.934572  0.739605
B -1.981927  0.168626
C  0.019155 -0.960382
D  0.352333 -1.162002
E -0.662735  1.375766

In [73]:
type(df[['X','Z']])

pandas.core.frame.DataFrame

**Creating a new column:**

In [85]:
df['new'] = df['W'] + df['Y']
df

#df['new2'] = df['W']+5
#df

          W         X         Y         Z      new1      new2       new
A  0.934572 -1.169964  0.739605 -1.112155  1.674177  5.934572  1.674177
B -1.981927 -1.193872  0.168626 -2.098613 -1.813301  3.018073 -1.813301
C  0.019155  0.302186 -0.960382  1.591763 -0.941227  5.019155 -0.941227
D  0.352333 -0.651946 -1.162002 -2.283038 -0.809668  5.352333 -0.809668
E -0.662735 -0.274120  1.375766 -0.190233  0.713031  4.337265  0.713031

** Removing Columns**

In [86]:
df.drop('new',axis=1, inplace=False)      #Not inplace unless specified!, check df  #axis=0 :rows,  #axis=1  :columns
#df1=df.drop('new',axis=1)      
#df1

          W         X         Y         Z      new1      new2
A  0.934572 -1.169964  0.739605 -1.112155  1.674177  5.934572
B -1.981927 -1.193872  0.168626 -2.098613 -1.813301  3.018073
C  0.019155  0.302186 -0.960382  1.591763 -0.941227  5.019155
D  0.352333 -0.651946 -1.162002 -2.283038 -0.809668  5.352333
E -0.662735 -0.274120  1.375766 -0.190233  0.713031  4.337265

In [46]:
df

          W         X         Y         Z       new      new1
A  5.000000  0.619268 -0.224696 -0.376552  4.775304  4.775304
B  1.119999  0.396218  0.639729 -1.551146  1.759728  1.759728
C  1.727638  0.167786  1.312171  1.664477  3.039809  3.039809
D  0.085753  0.366974  1.169764  0.741385  1.255517  1.255517
E  0.560169  0.296042 -0.187046  0.011453  0.373123  0.373123

In [87]:
df.drop('new1',axis=1,inplace=True)
df

          W         X         Y         Z      new2       new
A  0.934572 -1.169964  0.739605 -1.112155  5.934572  1.674177
B -1.981927 -1.193872  0.168626 -2.098613  3.018073 -1.813301
C  0.019155  0.302186 -0.960382  1.591763  5.019155 -0.941227
D  0.352333 -0.651946 -1.162002 -2.283038  5.352333 -0.809668
E -0.662735 -0.274120  1.375766 -0.190233  4.337265  0.713031

In [88]:
#Can also drop rows this way:
df.drop('A',axis=0)

          W         X         Y         Z      new2       new
B -1.981927 -1.193872  0.168626 -2.098613  3.018073 -1.813301
C  0.019155  0.302186 -0.960382  1.591763  5.019155 -0.941227
D  0.352333 -0.651946 -1.162002 -2.283038  5.352333 -0.809668
E -0.662735 -0.274120  1.375766 -0.190233  4.337265  0.713031

In [89]:
df

          W         X         Y         Z      new2       new
A  0.934572 -1.169964  0.739605 -1.112155  5.934572  1.674177
B -1.981927 -1.193872  0.168626 -2.098613  3.018073 -1.813301
C  0.019155  0.302186 -0.960382  1.591763  5.019155 -0.941227
D  0.352333 -0.651946 -1.162002 -2.283038  5.352333 -0.809668
E -0.662735 -0.274120  1.375766 -0.190233  4.337265  0.713031

** Selecting Rows**

In [93]:
#df.loc['D']     #By row index name 
#df.iloc[2]      #by index position
df.W             #For column use the name directly.
#print(type(df.iloc[3]))

A    0.934572
B   -1.981927
C    0.019155
D    0.352333
E   -0.662735
Name: W, dtype: float64

In [94]:
#df.iloc[2:4]
print(type(df.iloc[2:4]))

<class 'pandas.core.frame.DataFrame'>

** Selecting subset of rows and columns **

In [97]:
#df.loc['B','Y'] 
df.loc[['A','E'],['W','Z']]

          W         Z
A  0.934572 -1.112155
E -0.662735 -0.190233

### Conditional Selection

An important feature of pandas is conditional selection using bracket notation, very similar to numpy:

In [59]:
df

          W         X         Y         Z
A  5.000000  0.619268 -0.224696 -0.376552
B  1.119999  0.396218  0.639729 -1.551146
C  1.727638  0.167786  1.312171  1.664477
D  0.085753  0.366974  1.169764  0.741385
E  0.560169  0.296042 -0.187046  0.011453

In [60]:
df < 0 #Logical output

       W      X      Y      Z
A  False  False   True   True
B  False  False  False   True
C  False  False  False  False
D  False  False  False  False
E  False  False   True  False

In [61]:
df[df < 0]

    W   X         Y         Z
A NaN NaN -0.224696 -0.376552
B NaN NaN       NaN -1.551146
C NaN NaN       NaN       NaN
D NaN NaN       NaN       NaN
E NaN NaN -0.187046       NaN

In [62]:
df[df['Z'] > 0]

          W         X         Y         Z
C  1.727638  0.167786  1.312171  1.664477
D  0.085753  0.366974  1.169764  0.741385
E  0.560169  0.296042 -0.187046  0.011453

In [64]:
#df[df['Y']>0]['W']  # 
df[df['Y']>0][['W','X']]

          W         X
B  1.119999  0.396218
C  1.727638  0.167786
D  0.085753  0.366974

For two conditions you can use | and & with parenthesis:

In [65]:
df[(df['Z']> 0) & (df['Y'] > 0)]

          W         X         Y         Z
C  1.727638  0.167786  1.312171  1.664477
D  0.085753  0.366974  1.169764  0.741385

# Missing Data

Let's see methods to deal with Missing Data in pandas:

In [98]:
import numpy as np
import pandas as pd

In [99]:
df = pd.DataFrame({'A':[1,5,np.nan],
                  'B':[5,np.nan,np.nan],
                  'C':[1,2,3],
                  'D':[2,8,6]})
df

     A    B  C  D
0  1.0  5.0  1  2
1  5.0  NaN  2  8
2  NaN  NaN  3  6

In [100]:
df.dropna()

     A    B  C  D
0  1.0  5.0  1  2

In [101]:
df.dropna(axis=1)

   C  D
0  1  2
1  2  8
2  3  6

In [102]:
df

     A    B  C  D
0  1.0  5.0  1  2
1  5.0  NaN  2  8
2  NaN  NaN  3  6

In [103]:
df.fillna(value=99)

      A     B  C  D
0   1.0   5.0  1  2
1   5.0  99.0  2  8
2  99.0  99.0  3  6

In [104]:
df['A'].max()

5.0

In [108]:
df['B']=df['B'].fillna(value=df['A'].max())   #median, max, min
df

     A    B  C  D
0  1.0  5.0  1  2
1  5.0  5.0  2  8
2  1.0  5.0  3  6

In [109]:
df.fillna(value=10)

     A    B  C  D
0  1.0  5.0  1  2
1  5.0  5.0  2  8
2  1.0  5.0  3  6

# Groupby & Summary

The groupby method allows you to group rows of data together and call aggregate functions

In [1]:
import pandas as pd
# Create dataframe
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350],
       'Profit':[210,350,420,100,190,350]}
data

{'Company': ['GOOG', 'GOOG', 'MSFT', 'MSFT', 'FB', 'FB'],
 'Person': ['Sam', 'Charlie', 'Amy', 'Vanessa', 'Carl', 'Sarah'],
 'Sales': [200, 120, 340, 124, 243, 350],
 'Profit': [210, 350, 420, 100, 190, 350]}

In [2]:
df = pd.DataFrame(data)
df

  Company   Person  Sales  Profit
0    GOOG      Sam    200     210
1    GOOG  Charlie    120     350
2    MSFT      Amy    340     420
3    MSFT  Vanessa    124     100
4      FB     Carl    243     190
5      FB    Sarah    350     350

In [3]:
df['Sales'].quantile(0.25)  ### 0.5,0.75

143.0

In [4]:
by_comp = df.groupby("Company")

In [5]:
by_comp

In [6]:
by_comp['Sales'].mean()    # df.groupby('Company').mean() OR use std(), min(), max(), count()

Company
FB      296.5
GOOG    160.0
MSFT    232.0
Name: Sales, dtype: float64

In [116]:
b1=by_comp['Sales'].quantile(0.5)  ###calling the mean of fb
print(type(b1))
b1['FB']

<class 'pandas.core.series.Series'>

296.5

In [117]:
by_comp.describe() #by_comp['Sales'].describe()

        Sales                                                         Profit  \
        count   mean         std    min     25%    50%     75%    max  count
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0    2.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0    2.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0    2.0


          mean         std    min    25%    50%    75%    max
Company
FB       270.0  113.137085  190.0  230.0  270.0  310.0  350.0
GOOG     280.0   98.994949  210.0  245.0  280.0  315.0  350.0
MSFT     260.0  226.274170  100.0  180.0  260.0  340.0  420.0

In [118]:
(by_comp.describe())['Sales']['mean']['FB']  ###taking out value of mean of FB

296.5

In [119]:
b2=by_comp.describe()  ###another way
print(type(b2))
b2['Sales']['std']

<class 'pandas.core.frame.DataFrame'>

Company
FB       75.660426
GOOG     56.568542
MSFT    152.735065
Name: std, dtype: float64

In [120]:
b3= (by_comp.describe())
b3.loc['FB']['Sales'][1]

296.5

In [121]:
df.describe()

            Sales      Profit
count    6.000000    6.000000
mean   229.500000  270.000000
std    100.899455  121.819539
min    120.000000  100.000000
25%    143.000000  195.000000
50%    221.500000  280.000000
75%    315.750000  350.000000
max    350.000000  420.000000

In [122]:
by_comp.describe().transpose()

Company               FB        GOOG        MSFT
Sales  count    2.000000    2.000000    2.000000
       mean   296.500000  160.000000  232.000000
       std     75.660426   56.568542  152.735065
       min    243.000000  120.000000  124.000000
       25%    269.750000  140.000000  178.000000
       50%    296.500000  160.000000  232.000000
       75%    323.250000  180.000000  286.000000
       max    350.000000  200.000000  340.000000
Profit count    2.000000    2.000000    2.000000
       mean   270.000000  280.000000  260.000000
       std    113.137085   98.994949  226.274170
       min    190.000000  210.000000  100.000000
       25%    230.000000  245.000000  180.000000
       50%    270.000000  280.000000  260.000000
       75%    310.000000  315.000000  340.000000
       max    350.000000  350.000000  420.000000

In [9]:
by_comp.describe().transpose()[['FB','MSFT']]

Company               FB        MSFT
Sales  count    2.000000    2.000000
       mean   296.500000  232.000000
       std     75.660426  152.735065
       min    243.000000  124.000000
       25%    269.750000  178.000000
       50%    296.500000  232.000000
       75%    323.250000  286.000000
       max    350.000000  340.000000
Profit count    2.000000    2.000000
       mean   270.000000  260.000000
       std    113.137085  226.274170
       min    190.000000  100.000000
       25%    230.000000  180.000000
       50%    270.000000  260.000000
       75%    310.000000  340.000000
       max    350.000000  420.000000

# Merging, Joining, and Concatenating

There are 3 main ways of combining DataFrames together: Merging, Joining and Concatenating.

In [2]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[0,1,2,3])

In [3]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [4]:
df2

    A   B   C   D
0  A4  B4  C4  D4
1  A5  B5  C5  D5
2  A6  B6  C6  D6
3  A7  B7  C7  D7

In [5]:
#Concatenation
pd.concat([df1,df2])

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3
0  A4  B4  C4  D4
1  A5  B5  C5  D5
2  A6  B6  C6  D6
3  A7  B7  C7  D7

In [6]:
pd.concat([df1,df2],axis=1)   # Use same index and run

    A   B   C   D   A   B   C   D
0  A0  B0  C0  D0  A4  B4  C4  D4
1  A1  B1  C1  D1  A5  B5  C5  D5
2  A2  B2  C2  D2  A6  B6  C6  D6
3  A3  B3  C3  D3  A7  B7  C7  D7

In [7]:
left = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3','K4'],
                     'A': ['A0', 'A1', 'A2', 'A3','A4'],
                     'B': ['B0', 'B1', 'B2', 'B3','B4']})

right = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3','K5'],
                          'C': ['C0', 'C1', 'C2', 'C3','C5'],
                          'D': ['D0', 'D1', 'D2', 'D3','D5']})  
print(left)
print(right)

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3
4  K4  A4  B4
  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3
4  K5  C5  D5

In [8]:
# Merge
pd.merge(left,right,how='left',on='key')

  key   A   B    C    D
0  K0  A0  B0   C0   D0
1  K1  A1  B1   C1   D1
2  K2  A2  B2   C2   D2
3  K3  A3  B3   C3   D3
4  K4  A4  B4  NaN  NaN

In [9]:
left = pd.DataFrame({'key1': ['K0', 'K0', 'K1', 'K2'],
                     'key2': ['K0', 'K1', 'K0', 'K1'],
                        'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3']})
    
right = pd.DataFrame({'key1': ['K0', 'K1', 'K1', 'K2'],
                               'key2': ['K0', 'K0', 'K0', 'K0'],
                                  'C': ['C0', 'C1', 'C2', 'C3'],
                                  'D': ['D0', 'D1', 'D2', 'D3']})

In [10]:
print(left)
print(right)

  key1 key2   A   B
0   K0   K0  A0  B0
1   K0   K1  A1  B1
2   K1   K0  A2  B2
3   K2   K1  A3  B3
  key1 key2   C   D
0   K0   K0  C0  D0
1   K1   K0  C1  D1
2   K1   K0  C2  D2
3   K2   K0  C3  D3

In [11]:
pd.merge(left, right,on=['key1', 'key2'])

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

In [12]:
pd.merge(left, right, how='outer', on=['key1', 'key2'])  #Default how='inner'

  key1 key2    A    B    C    D
0   K0   K0   A0   B0   C0   D0
1   K0   K1   A1   B1  NaN  NaN
2   K1   K0   A2   B2   C1   D1
3   K1   K0   A2   B2   C2   D2
4   K2   K1   A3   B3  NaN  NaN
5   K2   K0  NaN  NaN   C3   D3

In [13]:
pd.merge(left, right, how='right', on=['key1', 'key2'])

  key1 key2    A    B   C   D
0   K0   K0   A0   B0  C0  D0
1   K1   K0   A2   B2  C1  D1
2   K1   K0   A2   B2  C2  D2
3   K2   K0  NaN  NaN  C3  D3

In [14]:
pd.merge(left, right, how='left', on=['key1', 'key2'])

  key1 key2   A   B    C    D
0   K0   K0  A0  B0   C0   D0
1   K0   K1  A1  B1  NaN  NaN
2   K1   K0  A2  B2   C1   D1
3   K1   K0  A2  B2   C2   D2
4   K2   K1  A3  B3  NaN  NaN

In [15]:
left = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2']},
                      index=['K0', 'K1', 'K2']) 

right = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                    'D': ['D0', 'D2', 'D3']},
                      index=['K0', 'K2', 'K3'])

In [16]:
print(left)
print(right)

     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2
     C   D
K0  C0  D0
K2  C2  D2
K3  C3  D3

In [17]:
df=left.join(right)
df
#pd.merge(left,right)
#df.loc[['K0'],['A']]=='A0' #['C']

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [18]:
df=left.join(right)
df
#df.loc[['K0'],['A']]=='A0' #['C']

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [19]:
left.join(right,how='outer')

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3

# Operations

There are lots of operations with pandas that will be really useful

In [20]:
#import pandas as pd
df = pd.DataFrame({'col1':[1,2,3,4,2],'col2':[444,555,666,444,444],'col3':['abcjadfsj','defljljlj','ghi','xyz','ghi']})
df.index=['a','b','c','d','e']
df

   col1  col2       col3
a     1   444  abcjadfsj
b     2   555  defljljlj
c     3   666        ghi
d     4   444        xyz
e     2   444        ghi

In [21]:
#Unique Values
#df['col3'].unique() #
df['col2'].nunique() # for number of unique values

3

In [22]:
#Freq table
df['col2'].value_counts()

444    3
666    1
555    1
Name: col2, dtype: int64

### Selection/Subsetting

In [23]:
#Select from DataFrame using criteria from multiple columns
#newdf = df[(df['col1']>2) & (df['col2']==444)]
newdf =df[(df['col3']=='ghi')]
newdf

   col1  col2 col3
c     3   666  ghi
e     2   444  ghi

### Applying function

In [25]:
def sq(x):
    return x**2
print(df)
df['col1']=df['col1'].apply(sq)
print(df)

   col1  col2       col3
a     1   444  abcjadfsj
b     4   555  defljljlj
c     9   666        ghi
d    16   444        xyz
e     4   444        ghi
   col1  col2       col3
a     1   444  abcjadfsj
b    16   555  defljljlj
c    81   666        ghi
d   256   444        xyz
e    16   444        ghi

In [26]:
df['col3'].apply(len)

a    9
b    9
c    3
d    3
e    3
Name: col3, dtype: int64

In [27]:
df['col1'].mean() #mean, median, std, min, max, count

74.0

** Permanently Removing a Column**

In [28]:
del df['col3']

In [29]:
df

   col1  col2
a     1   444
b    16   555
c    81   666
d   256   444
e    16   444

** Get column and index names: **

In [30]:
df.columns

Index(['col1', 'col2'], dtype='object')

In [31]:
df.index

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

** Sorting and Ordering a DataFrame:**

In [32]:
df

   col1  col2
a     1   444
b    16   555
c    81   666
d   256   444
e    16   444

In [33]:
df.sort_values(by='col1',ascending=True) 
#inplace=False by default df.sort_values("Name", axis = 0, ascending = True, inplace = True, na_position ='last')

   col1  col2
a     1   444
b    16   555
e    16   444
c    81   666
d   256   444

In [34]:
df

   col1  col2
a     1   444
b    16   555
c    81   666
d   256   444
e    16   444

** Find Null Values or Check for Null Values**

In [35]:
df.isnull()

    col1   col2
a  False  False
b  False  False
c  False  False
d  False  False
e  False  False

In [36]:
# Drop rows with NaN Values
df.dropna()

   col1  col2
a     1   444
b    16   555
c    81   666
d   256   444
e    16   444

In [37]:
df = pd.DataFrame({'col1':[1,2,3,np.nan],
                   'col2':[np.nan,555,666,444],
                   'col3':['abc','def','ghi','xyz']})
df

   col1   col2 col3
0   1.0    NaN  abc
1   2.0  555.0  def
2   3.0  666.0  ghi
3   NaN  444.0  xyz

In [38]:
df.isnull()

    col1   col2   col3
0  False   True  False
1  False  False  False
2  False  False  False
3   True  False  False

In [39]:
df.dropna()   # axis = 0 by default, axis = 1 for removing column with missing cases

   col1   col2 col3
1   2.0  555.0  def
2   3.0  666.0  ghi

In [40]:
df.fillna(22)

   col1   col2 col3
0   1.0   22.0  abc
1   2.0  555.0  def
2   3.0  666.0  ghi
3  22.0  444.0  xyz

In [41]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}
df = pd.DataFrame(data)
print(df)
#Pivot_table
df.pivot_table(values='D',index=['C'],columns=['B'])

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

B  one  two
C
x  2.5  2.0
y  2.0  5.0

In [42]:
# Sample of data frame
df.sample(2)

     A    B  C  D
5  bar  one  y  1
2  foo  two  x  2